Table of Contents
 Interface IImporter<T>
Namespace
IdeaStatiCa.BimApiLink.Importers
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IImporter<T> : IImporter where T : IIdeaObject
Type Parameters
T
Inherited Members
 IImporter.Create<T>(Identifier<T>)
 IImporter.Create(IIdentifier)
Methods
 Create(Identifier<T>)
T Create(Identifier<T> identifier)
Parameters
identifier Identifier<T>
Returns
T
 Edit this page